In [2]:
import numpy as np
import pandas as pd
from numpy.random import randint

In [3]:
columns= ['W', 'X', 'Y', 'Z'] 
index= ['A', 'B', 'C', 'D', 'E']

In [4]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [5]:
df = pd.DataFrame(data,index,columns)

In [6]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [9]:
# grabbing columns
df[['W','Y']]

    W   Y
A   2  -8
B   6  88
C   2 -26
D  16   3
E  30 -48

In [10]:
# grabbing rows
df.loc[['A','C']]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

In [12]:
# create new clm
df['new'] = df['W'] + df['Y']
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [14]:
# remove columns
df = df.drop('new',1)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [16]:
# select single row by index 
df.iloc[2]

W     2
X    21
Y   -26
Z   -13
Name: C, dtype: int32

In [17]:
# select multiple rows by index 
df.iloc[2:4]

    W   X   Y   Z
C   2  21 -26 -13
D  16  -1   3  51

In [18]:
# selecting subset of rows + columns at same time
df.loc[['C','B'],['X','Y']]

    X   Y
C  21 -26
B -29  88

In [6]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [8]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [11]:
# conditional selection- select feature W where X is positive

In [12]:
# select first row, where X is positive

In [19]:
# select all data, where W is positive and Y >1

In [20]:
# reset df index to integers

In [22]:
# add new column "Emirate" and set it into new index
new_ind= ['AUH', 'DXB', 'SHJ', 'FUJ', 'RAK']

In [24]:
#show df columns

In [25]:
# show df statistics

In [26]:
# show df information

In [27]:
# show df data types